app/controllers/admin_controller.rb

SELECT `users`.* FROM `users`
---
  def index
    if  !user_is_logged_in? and session[:admin] == 1
      @pageTipe = "admin"
      @users = User.all

INSERT INTO `users` (`name`, `mail`, `phone`, `password_digest`) VALUES ('usuario', 'usuario@gmail.com', '+34 666 666 666', '$2a$10$qadspLYMD3/H4pPZZDvowu9ZgO4rr7hbg3ZHNFYGZvELtUMaeons6')
---
  def create
    if  !user_is_logged_in? and session[:admin] == 1
	  user = User.new(name: params[:name], mail: params[:email], admin: params[:admin], phone: params[:phone], password: params[:pass], password_confirmation: params[:pass])
	  user.save

SELECT  `users`.* FROM `users` WHERE `users`.`idUser` = 17 LIMIT 1
UPDATE `users` SET `phone` = '+34 555 555', `password_digest` = '$2a$10$8SXjXGUA/E44oSKjP3EV6OXgdidn1YsXITf.aA/nOTCjvy0VIb4i.' WHERE `users`.`idUser` = 17
---
  def update
		@user = User.find_by(idUser: params[:id])
        if @user && !user_is_logged_in? and session[:admin] == 1
		@user.update(mail: params[:email], phone: params[:phone], password: params[:pass], password_confirmation: params[:pass], admin: params[:admin] )