app/controllers/calendar_controller.rb

SELECT `mod_calendars`.* FROM `mod_calendars` WHERE `mod_calendars`.`idUser_fk` = 16
---
  def index
    if user_is_logged_in?
      redirect_to root_url
	else
	  @pageTipe = "calendar"
	  @eventsOnCalendar = ModCalendar.where(idUser_fk: session[:user_id])

INSERT INTO `mod_calendars` (`date`, `category`, `dateF`, `name`, `web`, `text`, `color`, `idUser_fk`, `photo`) VALUES ('2017-06-10 00:00:00', 'aaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaa', '2017-06-10 00:00:00', 'this is the maximum fuking event in the ', 'ESTOOOOOOOOOOOOOOOO', 'Al contrario del pensamiento popular, el texto de Lorem Ipsum no es simplemente texto aleatorio. Tiene sus raices en una pieza cl´sica de la literatura del Latin, que data del año 45 antes de Cristo, haciendo que este adquiera mas de 2000 años de antiguedad. Richard McClintock, un profesor de Latin de la Universidad de Hampden-Sydney en Virginia, encontró una de las palabras más oscuras de la lengua del latín, \"consecteur\", en un pasaje de Lorem Ipsum, y al seguir leyendo distintos textos del latín, descubrió la fuente indudable. Lorem Ipsum viene de las secciones 1.10.32 y 1.10.33 de \"de Finnibus Bonorum et Malorum\" (Los Extremos del Bien y El Mal) por Cicero, escrito en el año 45 antes de Cristo. Este libro es un tratado de teoría de éticas, muy popular durante el Renacimiento. La primera linea del Lorem Ipsum, \"Lorem ipsum dolor sit amet..\", viene de una linea en la sección 1.10.32\r\n\r\nEl trozo de texto estándar de Lorem Ipsum usado desde el año 1500 es reproducido debajo para aquellos', 'bg-color-red', 3, '.jpg')
---
  def create
    if user_is_logged_in?
		render :file => "#{Rails.root}/public/404.html",  :status => 404, :layout => false
    else
		if params[:rep] == '1'
			rep = 1
		else
			rep = 0
		end

		@dates = params[:daterange].split(' - ')

		@firstDate = DateTime.strptime(@dates[0], '%d/%m/%Y %H:%M').to_s(:db)
		@secondDate = DateTime.strptime(@dates[1], '%d/%m/%Y %H:%M').to_s(:db)

		event = ModCalendar.new(date: @firstDate, anualRep: rep, category: params[:type], dateF: @secondDate, name: params[:title], web: params[:web], idUser_fk: session[:user_id], text: params[:text], color: params[:color])
		event.save

SELECT  `mod_calendars`.* FROM `mod_calendars` WHERE `mod_calendars`.`idcalendar` = 68 LIMIT 1
UPDATE `mod_calendars` SET `date` = '2017-06-01 00:00:00', `anualRep` = NULL, `category` = 'Categoria modificada', `name` = 'Evento Modificado', `web` = 'web modificada', `text` = 'texto modificado', `color` = 'bg-color-lighten' WHERE `mod_calendars`.`idcalendar` = 68
---
  def update
      if user_is_logged_in?
      render :file => "#{Rails.root}/public/404.html",  :status => 404, :layout => false
    else
		event = ModCalendar.find_by(idcalendar: params[:idcalendar])

		@dates = params[:daterange].split(' - ')

		event.update(date: @dates[0], anualRep: params[:rep], category: params[:category], dateF: @dates[1], name: params[:title], web: params[:web], idUser_fk: session[:user_id], text: params[:text], color: params[:color])