app/controllers/dashboard_controller.rb

SELECT  `users`.* FROM `users` WHERE `users`.`idUser` = 3 LIMIT 1
UPDATE `users` SET `avatar` = 'C7XGRvlXQAIYCGX.jpg' WHERE `users`.`idUser` = 3
SELECT  1 AS one FROM `users` WHERE `users`.`mail` = 'repaco9@gmail.com' AND (`users`.`idUser` != 3) LIMIT 1
---
	def update
	  @user = User.find_by(idUser: session[:user_id])
      if @user && @user.authenticate(params[:password]) && !user_is_logged_in?

			if params[:newpassword] != "" and params[:repeatnewpassword] != ""
				@user.update(mail: params[:email], phone: params[:phone], defaultHeight: params[:height], password: params[:newpassword], password_confirmation: params[:repeatnewpassword])
			else
				@user.update(mail: params[:email], phone: params[:phone], defaultHeight: params[:height])
			end

			if params.has_key?(:photo)
				@user.update(avatar: params[:photo])
			end

		    session[:user_id] = @user.idUser
			session[:name] = @user.name
			session[:mail] = @user.mail
			session[:admin] = @user.admin

			if @user.avatar.file.exists?