app/controllers/health_controller.rb

SELECT  `mod_healths`.* FROM `mod_healths` WHERE `mod_healths`.`idUser_fk` = 3 ORDER BY `mod_healths`.`date` DESC LIMIT 1
SELECT COUNT(*) FROM `mod_healths` WHERE `mod_healths`.`idUser_fk` = 16
---
	def index

	    if user_is_logged_in?
      		redirect_to root_url
		else
			@pageTipe = "health"
			@healthChart = ModHealth.where(idUser_fk: session[:user_id]).order(:date)

			if @healthChart.count() > 0

INSERT INTO `mod_healths` (`weight`, `pressureHigh`, `pressureLow`, `imc`, `height`, `date`, `idUser_fk`) VALUES (100, 111, '123', 28.91, 1.86, '2017-06-11', 3)
---
	def create
		if user_is_logged_in?
      		render :file => "#{Rails.root}/public/404.html",  :status => 404, :layout => false
		else
			@date = DateTime.strptime(params[:date], '%d/%m/%Y').to_s(:db)
			@height = params[:height].to_f
			@imc = (params[:weight].to_f / (params[:height].to_f * params[:height].to_f))
			health = ModHealth.new(weight: params[:weight], pressureHigh: params[:pressureHigh], pressureLow: params[:pressureLow], imc: @imc, height: params[:height], idUser_fk: session[:user_id], date: @date)
			health.save

SELECT `mod_healths`.* FROM `mod_healths` WHERE `mod_healths`.`idUser_fk` = 3 AND (`mod_healths`.`date` BETWEEN '2015-04-01' AND '2017-05-23') ORDER BY `mod_healths`.`date` ASC
---
	def dataRange

		if user_is_logged_in?
      		render :file => "#{Rails.root}/public/404.html",  :status => 404, :layout => false
		else
			@pageTipe = "health"

			@startDate = DateTime.strptime(params[:start], '%d/%m/%Y').to_s(:db)
			@endDate = DateTime.strptime(params[:end], '%d/%m/%Y').to_s(:db)

			@healthChart = ModHealth.where(idUser_fk: session[:user_id], :date => @startDate..@endDate).order(:date)