app/controllers/welcome_controller.rb

SELECT  `users`.* FROM `users` WHERE `users`.`idUser` = 16 LIMIT 1
---
  def index
	if (user_id = cookies.signed[:user_id])
      user = User.find_by(idUser: user_id)

SELECT  `users`.* FROM `users` WHERE `users`.`name` = 'user1' LIMIT 1
---
  def login
    user = User.find_by(name: params[:session][:user])